; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v10 ?v12)
             (pred_5 ?v3 ?v9)
             (pred_11 ?v10 ?v9)
             (pred_6 ?v5 ?v10 )
	     (pred_4 ?v10)
             (pred_7 ?v7)
             (pred_9 ?v3)
             (pred_12 ?v9)
             (pred_1 ?v10)
             (pred_10 ?v3)
             (pred_2 ?v10)
             (pred_8 ))



(:action op_3
:parameters (?v8 ?v13 ?v4 ?v11)
:precondition (and (pred_7 ?v8) (pred_7 ?v13) (pred_9 ?v4) (pred_12 ?v11)
          (pred_3 ?v8 ?v13) (pred_5 ?v4 ?v11)
                   (pred_11 ?v13 ?v11) (pred_4 ?v8) 
                   (pred_1 ?v13) (pred_10 ?v4))
:effect (and  (pred_2 ?v13) (not (pred_1 ?v13))))


(:action op_1
:parameters (?v8 ?v2)
:precondition (and (pred_7 ?v8) (pred_7 ?v2)
               (pred_4 ?v8) (pred_3 ?v8 ?v2) (pred_2 ?v2))
:effect (and (pred_4 ?v2) (not (pred_4 ?v8))))

(:action op_2
:parameters (?v8 ?v4)
:precondition (and (pred_7 ?v8) (pred_9 ?v4) 
                  (pred_4 ?v8) (pred_6 ?v4 ?v8) (pred_8 ))
:effect (and (pred_10 ?v4)
   (not (pred_6 ?v4 ?v8)) (not (pred_8 ))))


(:action op_4
:parameters (?v8 ?v1 ?v6)
:precondition (and (pred_7 ?v8) (pred_9 ?v1) (pred_9 ?v6)
                  (pred_4 ?v8) (pred_10 ?v6) (pred_6 ?v1 ?v8))
:effect (and (pred_10 ?v1) (pred_6 ?v6 ?v8)
        (not (pred_10 ?v6)) (not (pred_6 ?v1 ?v8))))

(:action op_5
:parameters (?v8 ?v4)
:precondition (and (pred_7 ?v8) (pred_9 ?v4) 
                  (pred_4 ?v8) (pred_10 ?v4))
:effect (and (pred_8 ) (pred_6 ?v4 ?v8) (not (pred_10 ?v4)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_14 obj_08 obj_30 obj_29 obj_22 obj_28 obj_03 obj_16 obj_06 obj_20 obj_09 obj_12 obj_17 obj_04 obj_25 obj_01 obj_18 obj_13 obj_24 obj_02 obj_15 obj_11 obj_26 obj_10 obj_05
    obj_19 obj_23
    obj_21 obj_07 obj_27
    )

    (:init
       (pred_8)

       (pred_7 obj_14)
       (pred_7 obj_08)
       (pred_7 obj_30)
       (pred_7 obj_29)
       (pred_7 obj_22)
       (pred_7 obj_28)
       (pred_7 obj_03)
       (pred_7 obj_16)
       (pred_7 obj_06)
       (pred_7 obj_20)
       (pred_7 obj_09)
       (pred_7 obj_12)
       (pred_7 obj_17)
       (pred_7 obj_04)
       (pred_7 obj_25)
       (pred_7 obj_01)
       (pred_7 obj_18)
       (pred_7 obj_13)
       (pred_7 obj_24)
       (pred_7 obj_02)
       (pred_7 obj_15)
       (pred_7 obj_11)
       (pred_7 obj_26)
       (pred_7 obj_10)
       (pred_7 obj_05)
       (pred_12 obj_19)
       (pred_12 obj_23)
       (pred_9 obj_21)
       (pred_9 obj_07)
       (pred_9 obj_27)

       (pred_3 obj_14 obj_28)
       (pred_3 obj_14 obj_08)
       (pred_3 obj_08 obj_03)
       (pred_3 obj_08 obj_30)
       (pred_3 obj_08 obj_14)
       (pred_3 obj_30 obj_16)
       (pred_3 obj_30 obj_29)
       (pred_3 obj_30 obj_08)
       (pred_3 obj_29 obj_06)
       (pred_3 obj_29 obj_22)
       (pred_3 obj_29 obj_30)
       (pred_3 obj_22 obj_20)
       (pred_3 obj_22 obj_29)
       (pred_3 obj_28 obj_09)
       (pred_3 obj_28 obj_03)
       (pred_3 obj_28 obj_14)
       (pred_3 obj_03 obj_12)
       (pred_3 obj_03 obj_16)
       (pred_3 obj_03 obj_08)
       (pred_3 obj_03 obj_28)
       (pred_3 obj_16 obj_17)
       (pred_3 obj_16 obj_06)
       (pred_3 obj_16 obj_30)
       (pred_3 obj_16 obj_03)
       (pred_3 obj_06 obj_04)
       (pred_3 obj_06 obj_20)
       (pred_3 obj_06 obj_29)
       (pred_3 obj_06 obj_16)
       (pred_3 obj_20 obj_25)
       (pred_3 obj_20 obj_22)
       (pred_3 obj_20 obj_06)
       (pred_3 obj_09 obj_01)
       (pred_3 obj_09 obj_12)
       (pred_3 obj_09 obj_28)
       (pred_3 obj_12 obj_18)
       (pred_3 obj_12 obj_17)
       (pred_3 obj_12 obj_03)
       (pred_3 obj_12 obj_09)
       (pred_3 obj_17 obj_13)
       (pred_3 obj_17 obj_04)
       (pred_3 obj_17 obj_16)
       (pred_3 obj_17 obj_12)
       (pred_3 obj_04 obj_24)
       (pred_3 obj_04 obj_25)
       (pred_3 obj_04 obj_06)
       (pred_3 obj_04 obj_17)
       (pred_3 obj_25 obj_02)
       (pred_3 obj_25 obj_20)
       (pred_3 obj_25 obj_04)
       (pred_3 obj_01 obj_15)
       (pred_3 obj_01 obj_18)
       (pred_3 obj_01 obj_09)
       (pred_3 obj_18 obj_11)
       (pred_3 obj_18 obj_13)
       (pred_3 obj_18 obj_12)
       (pred_3 obj_18 obj_01)
       (pred_3 obj_13 obj_26)
       (pred_3 obj_13 obj_24)
       (pred_3 obj_13 obj_17)
       (pred_3 obj_13 obj_18)
       (pred_3 obj_24 obj_10)
       (pred_3 obj_24 obj_02)
       (pred_3 obj_24 obj_04)
       (pred_3 obj_24 obj_13)
       (pred_3 obj_02 obj_05)
       (pred_3 obj_02 obj_25)
       (pred_3 obj_02 obj_24)
       (pred_3 obj_15 obj_11)
       (pred_3 obj_15 obj_01)
       (pred_3 obj_11 obj_26)
       (pred_3 obj_11 obj_18)
       (pred_3 obj_11 obj_15)
       (pred_3 obj_26 obj_10)
       (pred_3 obj_26 obj_13)
       (pred_3 obj_26 obj_11)
       (pred_3 obj_10 obj_05)
       (pred_3 obj_10 obj_24)
       (pred_3 obj_10 obj_26)
       (pred_3 obj_05 obj_02)
       (pred_3 obj_05 obj_10)
       (pred_1 obj_18)
       (pred_1 obj_12)
       (pred_1 obj_22)
       (pred_11  obj_18 obj_19)
       (pred_11  obj_12 obj_23)
       (pred_11  obj_22 obj_19)
       (pred_2 obj_14)
       (pred_2 obj_08)
       (pred_2 obj_30)
       (pred_2 obj_29)
       (pred_2 obj_28)
       (pred_2 obj_03)
       (pred_2 obj_16)
       (pred_2 obj_06)
       (pred_2 obj_20)
       (pred_2 obj_09)
       (pred_2 obj_17)
       (pred_2 obj_04)
       (pred_2 obj_25)
       (pred_2 obj_01)
       (pred_2 obj_13)
       (pred_2 obj_24)
       (pred_2 obj_02)
       (pred_2 obj_15)
       (pred_2 obj_11)
       (pred_2 obj_26)
       (pred_2 obj_10)
       (pred_2 obj_05)

       (pred_5  obj_21 obj_19)
       (pred_5  obj_07 obj_23)
       (pred_5  obj_27 obj_19)
       (pred_6 obj_21 obj_25)
       (pred_6 obj_07 obj_09)
       (pred_6 obj_27 obj_24)
       (pred_4 obj_20)
    )

    (:goal (and
       (pred_6 obj_21 obj_11)
       (pred_6 obj_27 obj_18)
    ))
(:constraints
  (always (not (pred_4 obj_13)))
)
)

; plan
1. (op_1 obj_20 obj_25)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_25)
   goals met: 0 of 2
2. (op_2 obj_25 obj_21)
   deleted: (pred_6 obj_21 obj_25) (pred_8)
   added: (pred_10 obj_21)
   goals met: 0 of 2
3. (op_1 obj_25 obj_02)
   deleted: (pred_4 obj_25)
   added: (pred_4 obj_02)
   goals met: 0 of 2
4. (op_1 obj_02 obj_24)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_24)
   goals met: 0 of 2
5. (op_1 obj_24 obj_10)
   deleted: (pred_4 obj_24)
   added: (pred_4 obj_10)
   goals met: 0 of 2
6. (op_1 obj_10 obj_26)
   deleted: (pred_4 obj_10)
   added: (pred_4 obj_26)
   goals met: 0 of 2
7. (op_1 obj_26 obj_11)
   deleted: (pred_4 obj_26)
   added: (pred_4 obj_11)
   goals met: 0 of 2
8. (op_3 obj_11 obj_18 obj_21 obj_19)
   deleted: (pred_1 obj_18)
   added: (pred_2 obj_18)
   goals met: 0 of 2
9. (op_5 obj_11 obj_21)
   deleted: (pred_10 obj_21)
   added: (pred_8) (pred_6 obj_21 obj_11)
   goals met: 1 of 2
10. (op_1 obj_11 obj_26)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_26)
   goals met: 1 of 2
11. (op_1 obj_26 obj_10)
   deleted: (pred_4 obj_26)
   added: (pred_4 obj_10)
   goals met: 1 of 2
12. (op_1 obj_10 obj_24)
   deleted: (pred_4 obj_10)
   added: (pred_4 obj_24)
   goals met: 1 of 2
13. (op_2 obj_24 obj_27)
   deleted: (pred_6 obj_27 obj_24) (pred_8)
   added: (pred_10 obj_27)
   goals met: 1 of 2
14. (op_1 obj_24 obj_10)
   deleted: (pred_4 obj_24)
   added: (pred_4 obj_10)
   goals met: 1 of 2
15. (op_1 obj_10 obj_26)
   deleted: (pred_4 obj_10)
   added: (pred_4 obj_26)
   goals met: 1 of 2
16. (op_1 obj_26 obj_11)
   deleted: (pred_4 obj_26)
   added: (pred_4 obj_11)
   goals met: 1 of 2
17. (op_1 obj_11 obj_18)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_18)
   goals met: 1 of 2
18. (op_5 obj_18 obj_27)
   deleted: (pred_10 obj_27)
   added: (pred_8) (pred_6 obj_27 obj_18)
   goals met: 2 of 2
